using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _06.BankAccountGenerator
{
    class Program
    {
        static void Main(string[] args)
        {

            // Задача 6. Генератор на банкови сметки 
            //Управителят на голяма банка в Уганда ви наема, за да му помогнете, като генерирате номера на банкови сметки. 
            //Всички възможни комбинации за номерата на сметките се образуват от пет елемента – цифрите на две двуцифрени числа 
            //и три букви. Елементите са в следната последователност:  • Елемент 1: число от a до 99, • Елемент 2: главна буква 
            //от b до 'Z' , • Елемент 3: малка буква от c до 'z', • Елемент 4: главна буква от d до 'Z' , • Елемент 5: число от e до 10.
            //Един номер е валиден, ако първото число, от което е създаден номерът, завършва на  2, а второто число завършва на 5.
            //Ще ви бъде дадено и число N, което показва максималния брой допустими валидни номера, които трябва да се генерират. 
            //Вашата задача е да генерирате номера и при достигане на максималния им брой валидни такива, да изпишете последния генериран номер.
            //Вход Входът се чете от конзолата и се състои от шест реда: 
            //• Първи ред: a  – цяло число в интервала[10...99] 
            // • Втори ред: b – буква от латинската азбука[A…Z] 
            //    • Трети ред: c – буква от латинската азбука[a…z] 
            //    • Четвърти ред:  d – буква от латинската азбука[A…Z] 
            //    • Пети ред: e – цяло число в интервала[10...99] 
            //    • Шести ред: N – цяло число в интервала[1...100]
            //Изход
            //На конзолата се отпечатва само последния номер, който е генериран при достигане на максималния брой позволени номера.


            int a = int.Parse(Console.ReadLine());
            char b = char.Parse(Console.ReadLine());
            char c = char.Parse(Console.ReadLine());
            char d = char.Parse(Console.ReadLine());
            int e = int.Parse(Console.ReadLine());
            int N = int.Parse(Console.ReadLine());
            int validNumbersCounter = 0;
            string result = "";

            for (int i = a; i <= 99; i++)
            {
                for (char j = b; j <= 'Z'; j++)
                {
                    for (char k = c; k <= 'z'; k++)
                    {
                        for (char l = d; l <= 'Z'; l++)
                        {
                            for (int m = e; m >= 10; m--)
                            {
                                if (i % 10 == 2 && m%10 == 5)
                                {
                                    validNumbersCounter++;
                                    result = i + "" + (char)j + "" + (char)k + "" + (char)l + "" + m;
                                    if (N == validNumbersCounter)
                                    {
                                        Console.WriteLine(result);
                                    }
                                        
                                    
                                    
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}
